# RebarNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarNumber Property
ParameterTypeId Class See Also
---
"Rebar Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace